"""Напишите функцию которая определит сколько раз
встречаеться элемент в списке."""

def StringSame(String):
    
    countString = String.count("l")
    print(countString)

StringSame("Hello there!!!")