"""Напишите функцию где исходный список содержит
положительные и отрицательные числа. Требуется
положительные поместить в один список, а отрицательные
- в другой."""
def sortNumber(listNum):
    if array[listNum] % 2 == 0:
       print(array[listNum])
    elif array[listNum] % 2 == 1:
        array[listNum] 
    print(array)
sortNumber([1, 2, 3, 4, 5])